power_generation_type = {
    '核能': ['核一#1', '核一#2', '核二#1', '核二#2', '核三#1', '核三#2'],
    '燃煤': ['林口#1', '林口#2', '林口#3', '台中#1', '台中#2', '台中#3',
           '台中#4', '台中#5', '台中#6', '台中#7', '台中#8', '台中#9',
           '台中#10', '興達#1', '興達#2', '興達#3', '興達#4', '大林#1', '大林#2'],
    '民營電廠-燃煤': ['和平#1', '和平#2', '麥寮#1', '麥寮#2', '麥寮#3'],
    '汽電共生': ['汽電共生'],
    '燃氣': ['大潭', '通霄', '興達', '南部', '大林'],
    '民營電廠-燃氣': ['海湖', '國光#1', '新桃#1', '星彰#1', '星元#1', '嘉惠#1', '豐德'],
    '燃油': ['協和'],
    '輕油': ['氣渦輪', '離島'],
    '水力': ['德基', '青山', '谷關', '天輪', '馬鞍', '萬大', '大觀', '鉅工',
           '碧海', '立霧', '龍澗', '卓蘭', '水里', '其他小水力'],
    '儲能': ['大觀二', '明潭'],
    '風力': ['風力發電'],
    '太陽能': ['太陽能發電']
}

power_generation_big_type = {
    '核能': ['核能'],
    '燃煤': ['燃煤', '民營電廠-燃煤'],
    '汽電共生': ['汽電共生'],
    '燃氣': ['燃氣', '民營電廠-燃氣'],
    '燃油': ['燃油', '輕油'],
    '水力': ['水力', '儲能'],
    '風力': ['風力'],
    '太陽能': ['太陽能']  
}