# 氣象站的相關資料

town_and_station = {
        '臺北市中正區': '臺北',
        '高雄市楠梓區': '高雄',
        '嘉義市西區': '嘉義',
        '澎湖縣望安鄉': '東吉島',
        '臺中市龍井區': '臺中電廠',
        '雲林縣臺西鄉': '臺西'
    }

site_location_dict = {
        '臺北': {'lat':'25.037658' ,'lon':'121.514853', 'elevation':6.26},
        '高雄': {'lat':'22.73043151' ,'lon':'120.3125156', 'elevation':11.79},
        '嘉義': {'lat':'23.495925' ,'lon':'120.4329056', 'elevation':26.9},
        '東吉島': {'lat':'23.25695' ,'lon':'119.6674667', 'elevation':44.5},
        '臺西': {'lat':'23.701544' ,'lon':'120.197547', 'elevation':12},
        '臺中電廠': {'lat':'24.214642' ,'lon':'120.490744', 'elevation':25},
    }