# 氣象站的相關資料


# 各站在氣象署網站的代號
station_id_table = {
    '臺北':'46692',
    '嘉義':'46748',
    '高雄':'46744',
    '東吉島':'46730',
    '臺西':'C0K53',
    '臺中電廠':'C0FA4',
    '通霄漁港':'C0E92',
    '福寶': 'C0G96',
}

# 鄉鎮市區與氣象站的對應
town_and_station = {
        '臺北市中正區': '臺北',
        '高雄市楠梓區': '高雄',
        '嘉義市西區': '嘉義',
        '澎湖縣望安鄉': '東吉島',
        '臺中市龍井區': '臺中電廠',
        '雲林縣臺西鄉': '臺西',
        '苗栗縣通霄鎮': '通霄漁港',
        '彰化縣福興鄉': '福寶',
    }

# 氣象站經緯度
site_location_dict = {
        '臺北': {'lat':'25.037658' ,'lon':'121.514853', 'elevation':6.26},
        '高雄': {'lat':'22.73043151' ,'lon':'120.3125156', 'elevation':11.79},
        '嘉義': {'lat':'23.495925' ,'lon':'120.4329056', 'elevation':26.9},
        '東吉島': {'lat':'23.25695' ,'lon':'119.6674667', 'elevation':44.5},
        '臺西': {'lat':'23.701544' ,'lon':'120.197547', 'elevation':12},
        '臺中電廠': {'lat':'24.214642' ,'lon':'120.490744', 'elevation':25},
        '通霄漁港': {'lat':'24.4986' ,'lon':'120.6739', 'elevation':20},
        '福寶': {'lat':'24.0443' ,'lon':'120.3814', 'elevation':5},
    }

# 各鄉鎮市區在氣象署網站的代號，第一個值是縣市代號，第二個值是鄉鎮市區代號
town_id_table = {
    '臺北市中正區': [63, 6300500],
    '嘉義市西區': [10020, 1002002],
    '高雄市楠梓區': [64, 6400400],
    '澎湖縣望安鄉': [10016, 1001605],
    '雲林縣臺西鄉': [10009, 1000916],
    '臺中市龍井區': [66, 6602500],
    '苗栗縣通霄鎮': [10005, 1000503],
    '彰化縣福興鄉': [10007, 1000706],
}

# 真正參與模型訓練與預測的氣象站
effective_station_list = [
    '臺北',
    '高雄',
    '嘉義',
    '東吉島',
    '臺中電廠',
    '通霄漁港',
    '福寶',
]